#4. Даны имена 2х человек (тип string). Если имена равны,
#то вывести сообщение о том, что люди являются тезками.

first_name = input("Input first name: ")
second_name = input("Input second name: ")

if first_name == second_name:
    print("You have the same name")
else:
    print("...")