# 1. Даны 4 числа типа int. Сравнить их и вывести наименьшее на консоль.

a = 2
b = 3
c = 4
d = 3
min = a
if b < min:
    min = b
if c < min:
    min = c
if d < min:
    min = d
print(min)